app/views/restaurants/index.html.erb

          Average rating: <%= star_rating(restaurant.average_rating) %>
          <% restaurant.reviews.all.each do |r| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restaurant_id" = $1  [["restaurant_id", 1]]

              <%= r.thoughts %>
              👍 <span class="endorsements_count"><%= r.endorsements.count %></span> - <%= link_to 'Endorse', review_endorsements_path(r), class: "endorsements-link" %>
---
SELECT COUNT(*) FROM "endorsements" WHERE "endorsements"."review_id" = $1  [["review_id", 1]]